matteorossini997-lab/PC-Monitor-Linux/sdkconfig.defaults
# ============================================================================
# PC Monitor - LVGL Configuration for ESP32-S3 N16R8 with PSRAM
# ============================================================================

# ESP32-S3 with Octal PSRAM (8MB)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM=y

# PSRAM Configuration
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Memory allocation strategy
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# FreeRTOS - Use PSRAM for large stacks
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# SPI Configuration
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Console output to UART0 for Wokwi debugging
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set

# Partition Table (Custom: 4MB factory + LittleFS storage)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
